Revit 2026 API

# RevitAPIPreEventArgs Class

---

The class is used as a base class for the arguments for any pre-event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPreEventArgs More

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RevitAPIPreEventArgs : RevitAPIEventArgs
```
```vb
Public Class RevitAPIPreEventArgs
	Inherits RevitAPIEventArgs
```
```cpp
public ref class RevitAPIPreEventArgs : public RevitAPIEventArgs
```
```fsharp
type RevitAPIPreEventArgs =
    class
        inherit RevitAPIEventArgs
    end
```

The RevitAPIPreEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | When the event is cancellable, may call the Cancel() method to cancel it. |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

A pre-event is the event raised before executing the process that was related with the event.

#### Reference

Autodesk.Revit.DB.Events Namespace

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPreEventArgs Autodesk.Revit.DB.EventsDocumentCreatingEventArgs Autodesk.Revit.DB.EventsDocumentOpeningEventArgs Autodesk.Revit.DB.EventsLinkedResourceOpeningEventArgs Autodesk.Revit.DB.EventsRevitAPIPreDocEventArgs Autodesk.Revit.UI.EventsApplicationClosingEventArgs Autodesk.Revit.UI.EventsDialogBoxShowingEventArgs Autodesk.Revit.UI.EventsDisplayingOptionsDialogEventArgs Autodesk.Revit.UI.EventsFormulaEditingEventArgs Autodesk.Revit.UI.EventsIdlingEventArgs